Repository: adelonem/sudoku
Catalog: Sudoku/Resources/Localizable.xcstrings
Source language: en
Languages: fr, zh_hans

source: %@ %@ in %@: other candidates in these cells can be eliminated.
fr: %1$@ %2$@ dans %3$@ : les autres candidats de ces cellules peuvent être éliminés.
zh_hans: %3$@中的%1$@ %2$@：可以排除这些单元格中的其他候选数。

source: %@ on %@ in %@: these digits can be eliminated from other cells.
fr: %1$@ sur %2$@ dans %3$@ : ces chiffres peuvent être éliminés des autres cellules.
zh_hans: %3$@中的%1$@（%2$@）：可以从其他单元格排除这些数字。

source: %@ on digit %lld: the highlighted cells allow eliminating %lld from the light cells.
fr: %1$@ sur le chiffre %2$lld : les cellules mises en valeur permettent d'éliminer %3$lld des cellules en clair.
zh_hans: %1$@（数字%2$lld）：高亮单元格可以从浅色单元格中排除%3$lld。

source: %1$@ on digit %2$lld: the highlighted pattern locks %3$lld into %4$@, so it can be removed from the other intersecting cells.
fr: %1$@ sur le chiffre %2$lld : le motif mis en évidence force %3$lld dans %4$@, il peut donc être retiré des autres cellules en intersection.
zh_hans: %1$@（数字%2$lld）：高亮模式将%3$lld锁定在%4$@中，因此可以从其他相交单元格中删除。

source: %lld actions already applied
fr: %1$lld actions déjà appliquées
zh_hans: 已应用 %1$lld 个操作

# %lld appears twice in %@ and %@, sharing %@.
source: %1$lld appears twice in %2$@ and %3$@, sharing %4$@.
fr: %1$lld apparaît deux fois dans %2$@ et %3$@, avec %4$@ en commun.
zh_hans: %1$lld在%2$@和%3$@中各出现两次，共享%4$@。

# %lld forms an almost X-Wing between %@ and %@.
source: %1$lld forms an almost X-Wing between %2$@ and %3$@.
fr: %1$lld forme un presque X-Wing entre %2$@ et %3$@.
zh_hans: %1$lld在%2$@和%3$@之间形成了一个近似 X-Wing。

source: %lld is already at row %lld, col. %lld
fr: le %1$lld est déjà en lig. %2$lld, col. %3$lld
zh_hans: %1$lld已在第%2$lld行第%3$lld列

source: %lld is already in box (%lld,%lld), row %lld, col. %lld
fr: le %1$lld est déjà en boîte (%2$lld,%3$lld), lig. %4$lld, col. %5$lld
zh_hans: %1$lld已在宫(%2$lld,%3$lld)的第%4$lld行第%5$lld列

source: %lld must be in this box on column %lld: it cannot be elsewhere in the box.
fr: Le %1$lld doit donc être dans cette boîte sur la colonne %2$lld : il ne peut être ailleurs dans la boîte.
zh_hans: %1$lld必须在该宫的第%2$lld列：不能在宫内其他位置。

source: %lld must be in this box on row %lld: it cannot be elsewhere in the box.
fr: Le %1$lld doit donc être dans cette boîte sur la ligne %2$lld : il ne peut être ailleurs dans la boîte.
zh_hans: %1$lld必须在该宫的第%2$lld行：不能在宫内其他位置。

# %lld only appears in %@ at %@.
source: %1$lld only appears in %2$@ at %3$@.
fr: %1$lld n'apparaît dans %2$@ qu'en %3$@.
zh_hans: %1$lld只在%2$@的%3$@出现。

source: → Candidates to eliminate: any digit outside {%@} in these cells
fr: → Candidats à éliminer : tout chiffre hors de {%@} dans ces cellules
zh_hans: → 要排除的候选数：这些单元格中{%@}以外的数字

# → Eliminate %@ from %@.
source: → Eliminate %1$@ from %2$@.
fr: → Éliminez %1$@ de %2$@.
zh_hans: → 从%2$@中删除%1$@。

source: → Eliminate %@ from cells: %@
fr: → Éliminer %1$@ des cellules : %2$@
zh_hans: → 从单元格%2$@中排除%1$@

# → Eliminate %lld from %@.
source: → Eliminate %1$lld from %2$@.
fr: → Éliminez %1$lld de %2$@.
zh_hans: → 从%2$@中删除%1$lld。

source: → Eliminate %lld from box (%lld,%lld) at: %@
fr: → Éliminer le %1$lld de la boîte (%2$lld,%3$lld) en : %4$@
zh_hans: → 从宫(%2$lld,%3$lld)的%4$@中排除%1$lld

source: → Eliminate %lld from column %lld at %@
fr: → Éliminer le %1$lld de la colonne %2$lld en %3$@
zh_hans: → 从第%2$lld列的%3$@中排除%1$lld

source: → Eliminate %lld from row %lld at %@
fr: → Éliminer le %1$lld de la ligne %2$lld en %3$@
zh_hans: → 从第%2$lld行的%3$@中排除%1$lld

# → Eliminate %lld from row %lld, column %lld.
source: → Eliminate %1$lld from row %2$lld, column %3$lld.
fr: → Éliminez %1$lld de la ligne %2$lld, colonne %3$lld.
zh_hans: → 从第%2$lld行第%3$lld列删除%1$lld。

source: → Eliminate %lld from the conflicting color.
fr: → Éliminez %1$lld de la couleur en conflit.
zh_hans: → 从冲突颜色中删除%1$lld。

source: → Eliminate %lld from those cells.
fr: → Éliminez %1$lld de ces cellules.
zh_hans: → 从这些单元格中删除%1$lld。

source: → Eliminate the candidates belonging to the contradictory color.
fr: → Éliminez les candidats appartenant à la couleur contradictoire.
zh_hans: → 删除属于矛盾颜色的候选数。

source: → Only %@ can hold %lld
fr: → Seule %1$@ peut accueillir le %2$lld
zh_hans: → 只有%1$@可以放置%2$lld

source: → Only %lld remains possible
fr: → Seul le %lld reste possible
zh_hans: → 只剩%lld可以填入

# → So row %lld, column %lld must be %lld.
source: → So row %1$lld, column %2$lld must be %3$lld.
fr: → La ligne %1$lld, colonne %2$lld doit donc être %3$lld.
zh_hans: → 因此，第%1$lld行第%2$lld列必定是%3$lld。

source: 1 action already applied
fr: 1 action déjà appliquée
zh_hans: 已应用 1 个操作

source: A simple tap toggles the selected digit as a pencil mark in the chosen cell.
fr: Un simple toucher ajoute ou retire le chiffre sélectionné comme note dans la case choisie.
zh_hans: 单击会在所选单元格中将当前数字切换为铅笔记号。

source: All valid candidates are visible. Advance through the hints to see each elimination applied to this board.
fr: Tous les candidats valides sont visibles. Parcourez les indices pour voir chaque élimination appliquée à cette grille.
zh_hans: 所有有效候选数都可见。逐步查看提示，以了解每次删除如何应用到此棋盘。

source: Alternating Inference Chain
fr: Chaîne d'inférence alternée
zh_hans: 交替推理链

source: Alternating Inference Chain on %1$lld: any cell that sees both colors cannot keep %2$lld.
fr: Chaîne d'inférences alternées sur %1$lld : toute cellule qui voit les deux couleurs ne peut pas garder %2$lld.
zh_hans: 数字%1$lld的交替推理链：任何同时看到两种颜色的单元格都不能保留%2$lld。

source: Alternating Inference Chain on %lld: these cells see both ends of the chain.
fr: Chaîne d'inférence alternée sur %lld : ces cellules voient les deux extrémités de la chaîne.
zh_hans: 交替推理链（%lld）：这些单元格可以看到链的两端。

source: Alternating Inference Chain: one color contradicts itself, so the opposite color is forced.
fr: Chaîne d'inférences alternées : une couleur se contredit elle-même, donc la couleur opposée est forcée.
zh_hans: 交替推理链：一种颜色自相矛盾，因此另一种颜色被迫成立。

source: Alternating Inference Chain: one color leads to a contradiction — the other color is correct.
fr: Chaîne d'inférence alternée : une couleur mène à une contradiction — l'autre couleur est correcte.
zh_hans: 交替推理链：一种颜色导致矛盾——另一种颜色正确。

# Any cell that sees all four highlighted cells cannot contain %lld: %@.
source: Any cell that sees all four highlighted cells cannot contain %1$lld: %2$@.
fr: Toute cellule qui voit les quatre cellules mises en évidence ne peut pas contenir %1$lld : %2$@.
zh_hans: 任何能看到这四个高亮单元格的单元格都不能包含%1$lld：%2$@。

# Any cell that sees both roofs cannot contain %lld: %@.
source: Any cell that sees both roofs cannot contain %1$lld: %2$@.
fr: Toute cellule qui voit les deux sommets ne peut pas contenir %1$lld : %2$@.
zh_hans: 任何同时看到两个屋顶单元格的单元格都不能包含%1$lld：%2$@。

source: Any common peer of the pivot and both wings sees all ways the pattern can place %1$lld: %2$@.
fr: Tout pair commun au pivot et aux deux ailes voit toutes les façons dont le motif peut placer %1$lld : %2$@.
zh_hans: 枢轴与两个翼共享的任意同伴格都能看到该模式放置%1$lld的所有方式：%2$@。

# Assume %lld at row %lld, column %lld.
source: Assume %1$lld at row %2$lld, column %3$lld.
fr: Supposez %1$lld à la ligne %2$lld, colonne %3$lld.
zh_hans: 假设第%2$lld行第%3$lld列为%1$lld。

source: Blue
fr: Bleu
zh_hans: 蓝色

source: Board
fr: Grille
zh_hans: 棋盘

source: box (%lld,%lld)
fr: la boîte (%1$lld,%2$lld)
zh_hans: 宫(%1$lld,%2$lld)

source: Box (%lld,%lld): already contains %@
fr: Boîte (%1$lld,%2$lld) : contient déjà %3$@
zh_hans: 宫(%1$lld,%2$lld)：已包含%3$@

source: Build the alternating chain from strong and weak links.
fr: Construisez la chaîne alternée à partir des liens forts et faibles.
zh_hans: 从强链接和弱链接构建交替链。

source: c.%lld
fr: col. %lld
zh_hans: 列%lld

source: Cancel
fr: Annuler
zh_hans: 取消

source: Candidate %lld is restricted across the whole WXYZ-Wing pattern.
fr: Le candidat %1$lld est restreint sur tout le motif WXYZ-Wing.
zh_hans: 候选数%1$lld在整个 WXYZ-Wing 模式中受到限制。

# candidate %lld would be true in both %@ and %@, which see each other
source: candidate %1$lld would be true in both %2$@ and %3$@, which see each other
fr: le candidat %1$lld serait vrai à la fois dans %2$@ et %3$@, qui se voient
zh_hans: 候选数%1$lld会同时在%2$@和%3$@中成立，而这两个单元格彼此可见

source: Cell at row %lld, column %lld has only one possible candidate: %lld.
fr: La cellule ligne %1$lld, colonne %2$lld n'a qu'un seul candidat possible : %3$lld.
zh_hans: 第%1$lld行第%2$lld列的单元格只有一个候选数：%3$lld。

# Cells %@ see both colors, so they cannot contain %lld.
source: Cells %1$@ see both colors, so they cannot contain %2$lld.
fr: Les cellules %1$@ voient les deux couleurs, elles ne peuvent donc pas contenir %2$lld.
zh_hans: 单元格%1$@同时看到两种颜色，因此不能包含%2$lld。

# Cells %@ see one candidate of each color, so they cannot contain %lld.
source: Cells %1$@ see one candidate of each color, so they cannot contain %2$lld.
fr: Les cellules %1$@ voient un candidat de chaque couleur, elles ne peuvent donc pas contenir %2$lld.
zh_hans: 单元格%1$@能看到每种颜色的一个候选数，因此不能包含%2$lld。

# Cells aligned with the base pattern in that box cannot keep %lld: %@.
source: Cells aligned with the base pattern in that box cannot keep %1$lld: %2$@.
fr: Les cellules alignées sur le motif de base dans cette boîte ne peuvent pas garder %1$lld : %2$@.
zh_hans: 该宫内与基础模式对齐的单元格不能保留%1$lld：%2$@。

source: Clock
fr: Chronomètre
zh_hans: 计时器

source: Color
fr: Couleur
zh_hans: 颜色

source: Color the alternating chain for digit %lld.
fr: Coloriez la chaîne alternée pour le chiffre %1$lld.
zh_hans: 为数字%1$lld的交替链着色。

source: Color the chain for %lld across the highlighted candidates.
fr: Coloriez la chaîne pour %1$lld à travers les candidats mis en évidence.
zh_hans: 沿着高亮候选数为%1$lld构建着色链。

source: Color the conjugate chain for %lld with two alternating colors.
fr: Coloriez la chaîne conjuguée pour %1$lld avec deux couleurs alternées.
zh_hans: 用两种交替颜色为%1$lld的共轭链着色。

source: column %lld
fr: la colonne %lld
zh_hans: 第%lld列

source: Column %lld: already contains %@
fr: Colonne %1$lld : contient déjà %2$@
zh_hans: 第%1$lld列：已包含%2$@

source: Completed Puzzles
fr: Puzzles complétés
zh_hans: 已完成的谜题

source: Congratulations!
fr: Félicitations !
zh_hans: 恭喜！

source: Counts incorrect placements detected in the grid.
fr: Compte les placements incorrects détectés dans la grille.
zh_hans: 统计棋盘中检测到的错误填数。

source: Current action
fr: Action en cours
zh_hans: 当前操作

source: Diabolical
fr: Diabolique
zh_hans: 地狱

source: Difficulty
fr: Difficulté
zh_hans: 难度

source: Digits %@ only appear as candidates in these %lld cells of %@: %@.
fr: Les chiffres %1$@ n'apparaissent en tant que candidats que dans ces %2$lld cellules de %3$@ : %4$@.
zh_hans: 数字%1$@只出现在%3$@的这%2$lld个单元格中：%4$@。

source: Dismiss
fr: Fermer
zh_hans: 关闭

source: Dismiss hint
fr: Fermer l'indice
zh_hans: 关闭提示

source: Double-tap a cell to place the digit
fr: Double-touchez une case pour placer le chiffre
zh_hans: 双击格子以填入数字

source: Each area must contain the digits 1 to 9 exactly once.
fr: Chaque zone doit contenir les chiffres de 1 à 9 une seule fois.
zh_hans: 每个区域都必须恰好包含 1 到 9 这九个数字。

source: Easy
fr: Facile
zh_hans: 简单

source: Errors
fr: Erreurs
zh_hans: 错误

# Every valid branch forces %lld at row %lld, column %lld.
source: Every valid branch forces %1$lld at row %2$lld, column %3$lld.
fr: Chaque branche valide force %1$lld à la ligne %2$lld, colonne %3$lld.
zh_hans: 每条有效分支都会迫使第%2$lld行第%3$lld列为%1$lld。

source: Extreme
fr: Extrême
zh_hans: 极难

source: Fill every row, column, and 3×3 box
fr: Remplissez chaque ligne, colonne et bloc 3×3
zh_hans: 填满每一行、每一列和每个 3×3 宫格

source: Finish without conflicts
fr: Terminez sans conflit
zh_hans: 无冲突完成

source: Finned X-Wing
fr: X-Wing aileron
zh_hans: 鱼鳍X-Wing

source: Finned X-Wing on %lld: the fin confines eliminations to the shared box.
fr: X-Wing aileron sur le %lld : l'aileron confine les éliminations à la boîte partagée.
zh_hans: 鱼鳍X-Wing（%lld）：鱼鳍将排除限制在共享宫内。

source: Finned X-Wing on %lld: the fin restricts the usual X-Wing eliminations to the shared box.
fr: Finned X-Wing sur %1$lld : l'aileron limite les éliminations habituelles du X-Wing à la boîte partagée.
zh_hans: 数字%1$lld的 Finned X-Wing：鳍将常规 X-Wing 的删除限制在共享宫内。

source: Fixed digits stay in place
fr: Les chiffres fixes restent en place
zh_hans: 固定数字不能更改

source: Focus on digit %lld
fr: Concentrez-vous sur le chiffre %1$lld
zh_hans: 关注数字%1$lld

source: Font
fr: Police
zh_hans: 字体

source: Forcing Chains
fr: Chaînes forcées
zh_hans: 强制链

source: Forcing Chains: a hypothesis at (%lld,%lld) leads to a contradiction — %lld is certain at (%lld,%lld).
fr: Chaînes forcées : une hypothèse en (%1$lld,%2$lld) mène à une contradiction — %3$lld est certain en (%4$lld,%5$lld).
zh_hans: 强制链：在(%1$lld,%2$lld)的假设导致矛盾——%3$lld确定在(%4$lld,%5$lld)。

source: Forcing Chains: assuming %1$lld at row %2$lld, column %3$lld leads to a contradiction, so %4$lld can be eliminated from this cell.
fr: Chaînes forcées : supposer %1$lld à la ligne %2$lld, colonne %3$lld mène à une contradiction, donc %4$lld peut être éliminé de cette cellule.
zh_hans: 强制链：假设第%2$lld行第%3$lld列为%1$lld会导致矛盾，因此可以从该单元格删除%4$lld。

source: Forcing Chains: regardless of the values at (%lld,%lld), cell (%lld,%lld) is always %lld.
fr: Chaînes forcées : quelles que soient les valeurs de (%1$lld,%2$lld), la cellule (%3$lld,%4$lld) vaut toujours %5$lld.
zh_hans: 强制链：无论(%1$lld,%2$lld)的值如何，单元格(%3$lld,%4$lld)始终为%5$lld。

source: Forcing Chains: whatever the value at row %1$lld, column %2$lld, row %3$lld, column %4$lld is always %5$lld.
fr: Chaînes forcées : quelle que soit la valeur en ligne %1$lld, colonne %2$lld, la ligne %3$lld, colonne %4$lld est toujours %5$lld.
zh_hans: 强制链：无论第%1$lld行第%2$lld列取何值，第%3$lld行第%4$lld列始终是%5$lld。

source: Goal
fr: Objectif
zh_hans: 目标

source: Green
fr: Vert
zh_hans: 绿色

source: Grid Controls
fr: Commandes de la grille
zh_hans: 棋盘操作

source: Hand
fr: Manuscrit
zh_hans: 手写

source: Hard
fr: Difficile
zh_hans: 困难

source: Helpful Tools
fr: Outils utiles
zh_hans: 实用工具

source: Hidden Pair
fr: Paire cachée
zh_hans: 隐性数对

source: Hidden Quad
fr: Quadruplet caché
zh_hans: 隐性四数组

source: Hidden Single
fr: Singleton caché
zh_hans: 隐性唯一法

source: Hidden Triple
fr: Triplet caché
zh_hans: 隐性三数组

source: Hide Candidates
fr: Masquer les candidats
zh_hans: 隐藏候选数

source: Hide Hint
fr: Masquer l'indice
zh_hans: 隐藏提示

# Hint %lld of %lld
source: Hint %1$lld of %2$lld
fr: Indice %1$lld sur %2$lld
zh_hans: 提示 %1$lld / %2$lld

source: Hints
fr: Indices
zh_hans: 提示

source: Hints used
fr: Indices utilisés
zh_hans: 已用提示

source: How to Play
fr: Comment jouer
zh_hans: 玩法说明

# If %@ also kept only %@, the rectangle could be completed in two different ways.
source: If %1$@ also kept only %2$@, the rectangle could be completed in two different ways.
fr: Si %1$@ ne gardait aussi que %2$@, le rectangle pourrait être complété de deux façons différentes.
zh_hans: 如果%1$@也只保留%2$@，这个矩形就可能以两种不同方式完成。

source: If %lld were elsewhere in column %lld, box (%lld,%lld) would have no room for it.
fr: Si le %1$lld était ailleurs dans la colonne %2$lld, la boîte (%3$lld,%4$lld) n'aurait plus de place pour lui.
zh_hans: 如果%1$lld在第%2$lld列的其他位置，宫(%3$lld,%4$lld)将无处放置它。

source: If %lld were elsewhere in row %lld, box (%lld,%lld) would have no room for it.
fr: Si le %1$lld était ailleurs dans la ligne %2$lld, la boîte (%3$lld,%4$lld) n'aurait plus de place pour lui.
zh_hans: 如果%1$lld在第%2$lld行的其他位置，宫(%3$lld,%4$lld)将无处放置它。

source: If the same digit appears twice in a row, column, or box, the grid is incorrect.
fr: Si le même chiffre apparaît deux fois dans une ligne, une colonne ou un bloc, la grille est incorrecte.
zh_hans: 如果同一个数字在某一行、某一列或某个宫格中出现两次，棋盘就是错误的。

source: In %@, digit %lld can only be placed at row %lld, column %lld.
fr: Dans %1$@, le chiffre %2$lld ne peut être placé qu'en ligne %3$lld, colonne %4$lld.
zh_hans: 在%1$@中，数字%2$lld只能放在第%3$lld行第%4$lld列。

source: In box (%lld,%lld), %lld is confined to column %lld: it can be eliminated from the rest of this column.
fr: Dans la boîte (%1$lld,%2$lld), le %3$lld est confiné à la colonne %4$lld : il peut être éliminé du reste de cette colonne.
zh_hans: 在宫(%1$lld,%2$lld)中，%3$lld仅限于第%4$lld列：可以从该列的其他位置排除。

source: In box (%lld,%lld), %lld is confined to row %lld: it can be eliminated from the rest of this row.
fr: Dans la boîte (%1$lld,%2$lld), le %3$lld est confiné à la ligne %4$lld : il peut être éliminé du reste de cette ligne.
zh_hans: 在宫(%1$lld,%2$lld)中，%3$lld仅限于第%4$lld行：可以从该行的其他位置排除。

source: In box (%lld,%lld), %lld is only a candidate at %@ of column %lld.
fr: Dans la boîte (%1$lld,%2$lld), le %3$lld n'est candidat qu'en %4$@ de la colonne %5$lld.
zh_hans: 在宫(%1$lld,%2$lld)中，%3$lld只出现在第%5$lld列的%4$@。

source: In box (%lld,%lld), %lld is only a candidate at %@ of row %lld.
fr: Dans la boîte (%1$lld,%2$lld), le %3$lld n'est candidat qu'en %4$@ de la ligne %5$lld.
zh_hans: 在宫(%1$lld,%2$lld)中，%3$lld只出现在第%5$lld行的%4$@。

source: In column %lld, %lld is confined to box (%lld,%lld): it can be eliminated from the rest of this box.
fr: Dans la colonne %1$lld, le %2$lld est confiné à la boîte (%3$lld,%4$lld) : il peut être éliminé du reste de cette boîte.
zh_hans: 在第%1$lld列，%2$lld仅限于宫(%3$lld,%4$lld)：可以从该宫的其他位置排除。

source: In column %lld, %lld is only a candidate at %@, all in box (%lld,%lld).
fr: Dans la colonne %1$lld, le %2$lld n'est candidat qu'en %3$@, toutes dans la boîte (%4$lld,%5$lld).
zh_hans: 在第%1$lld列，%2$lld的候选位置%3$@全在宫(%4$lld,%5$lld)内。

source: In row %lld, %lld is confined to box (%lld,%lld): it can be eliminated from the rest of this box.
fr: Dans la ligne %1$lld, le %2$lld est confiné à la boîte (%3$lld,%4$lld) : il peut être éliminé du reste de cette boîte.
zh_hans: 在第%1$lld行，%2$lld仅限于宫(%3$lld,%4$lld)：可以从该宫的其他位置排除。

source: In row %lld, %lld is only a candidate at %@, all in box (%lld,%lld).
fr: Dans la ligne %1$lld, le %2$lld n'est candidat qu'en %3$@, toutes dans la boîte (%4$lld,%5$lld).
zh_hans: 在第%1$lld行，%2$lld的候选位置%3$@全在宫(%4$lld,%5$lld)内。

source: Light bulb
fr: Ampoule
zh_hans: 灯泡

source: Load Puzzle
fr: Charger le puzzle
zh_hans: 加载谜题

source: Long-press an editable cell to clear it
fr: Maintenez une case modifiable pour l'effacer
zh_hans: 长按可编辑格子以清除内容

source: Medium
fr: Moyen
zh_hans: 中等

source: Naked Pair
fr: Paire nue
zh_hans: 显性数对

source: Naked Quad
fr: Quadruplet nu
zh_hans: 显性四数组

source: Naked Single
fr: Singleton nu
zh_hans: 唯余法

source: Naked Triple
fr: Triplet nu
zh_hans: 显性三数组

source: New Game
fr: Nouvelle partie
zh_hans: 新游戏

source: New Random Puzzle
fr: Nouveau puzzle aléatoire
zh_hans: 随机新谜题

source: Next hint
fr: Indice suivant
zh_hans: 下一个提示

source: No candidates are removed on this step. Use the remaining possibility in the highlighted cell.
fr: Aucun candidat n'est supprimé à cette étape. Utilisez la possibilité restante dans la cellule mise en évidence.
zh_hans: 此步骤不会删除任何候选数。请使用高亮单元格中的剩余可能值。

source: No Completed Puzzles
fr: Aucun puzzle complété
zh_hans: 没有已完成的谜题

source: No Hint
fr: Aucun indice
zh_hans: 无提示

source: not a candidate
fr: non candidat
zh_hans: 非候选数

source: Occupied (no candidates): %@
fr: Occupées (aucun candidat) : %@
zh_hans: 已占用（无候选数）：%@

source: One color causes a contradiction: %@.
fr: Une couleur provoque une contradiction : %1$@.
zh_hans: 一种颜色导致了矛盾：%1$@。

source: One color must contain the true %lld somewhere on the chain.
fr: L'une des couleurs doit contenir le vrai %1$lld quelque part sur la chaîne.
zh_hans: 其中一种颜色必须在链上的某处包含真正的%1$lld。

source: One of the two colors must contain the true %lld.
fr: L'une des deux couleurs doit contenir le vrai %1$lld.
zh_hans: 两种颜色中必有一种包含真正的%1$lld。

source: Opens a guided hint view. If a hint is already visible, tapping again hides it.
fr: Ouvre une vue d'indice guidée. Si un indice est déjà affiché, touchez à nouveau pour le masquer.
zh_hans: 打开引导式提示视图；如果提示已显示，再点一次即可隐藏。

source: Or enter a puzzle ID
fr: Ou entrez un identifiant de puzzle
zh_hans: 或输入谜题编号

source: Pink
fr: Rose
zh_hans: 粉色

# Pivot %@ and wings %@ together cover digits %@.
source: Pivot %1$@ and wings %2$@ together cover digits %3$@.
fr: Le pivot %1$@ et les ailes %2$@ couvrent ensemble les chiffres %3$@.
zh_hans: 枢轴%1$@和翼%2$@共同覆盖数字%3$@。

# Pivot %@ contains %@.
source: Pivot %1$@ contains %2$@.
fr: Le pivot %1$@ contient %2$@.
zh_hans: 枢轴%1$@包含%2$@。

# Pivot %@ contains %lld and %lld.
source: Pivot %1$@ contains %2$lld and %3$lld.
fr: Le pivot %1$@ contient %2$lld et %3$lld.
zh_hans: 枢轴%1$@包含%2$lld和%3$lld。

source: Play Again?
fr: Rejouer ?
zh_hans: 再玩一次？

source: Pointing Pair
fr: Paire pointante
zh_hans: 宫内指向法

source: Previous eliminations are already reflected on the board. The current step is now a placement.
fr: Les éliminations précédentes sont déjà reflétées sur la grille. L'étape actuelle est maintenant un placement.
zh_hans: 之前的删除已经反映在棋盘上。当前步骤现在是一次填数。

source: Previous hint
fr: Indice précédent
zh_hans: 上一个提示

source: Purple
fr: Violet
zh_hans: 紫色

source: Puzzle can be auto-completed!
fr: Le puzzle peut être complété automatiquement !
zh_hans: 谜题可以自动完成！

source: Puzzle ID
fr: Identifiant
zh_hans: 谜题编号

source: Puzzles you solve will appear here.
fr: Les puzzles résolus apparaîtront ici.
zh_hans: 您解开的谜题将显示在这里。

source: r.%lld
fr: lig. %lld
zh_hans: 行%lld

source: r.%lld, c.%lld
fr: lig. %1$lld, col. %2$lld
zh_hans: 行%1$lld, 列%2$lld

source: Red
fr: Rouge
zh_hans: 红色

source: Remove candidate %lld from %@.
fr: Retirez le candidat %1$lld de %2$@.
zh_hans: 从%2$@中删除候选数%1$lld。

source: Remove these candidates: %@.
fr: Retirez ces candidats : %1$@.
zh_hans: 删除这些候选数：%1$@。

source: Replay Puzzle #%lld
fr: Rejouer le puzzle #%lld
zh_hans: 重玩谜题 #%lld

source: Resets the current puzzle if you want to start over from the initial grid.
fr: Réinitialise la grille en cours si vous voulez repartir de la configuration initiale.
zh_hans: 如果你想回到初始棋盘，它会重置当前谜题。

source: Restart
fr: Recommencer
zh_hans: 重新开始

source: Restart Puzzle
fr: Redémarrer la grille
zh_hans: 重新开始谜题

source: Restart Puzzle?
fr: Recommencer le puzzle ?
zh_hans: 重新开始谜题？

source: Return to continue solving the current puzzle.
fr: Revenez pour continuer à résoudre la grille en cours.
zh_hans: 返回以继续解决当前谜题。

source: row %lld
fr: la ligne %lld
zh_hans: 第%lld行

# row %lld, column %lld = %lld
source: row %1$lld, column %2$lld = %3$lld
fr: ligne %1$lld, colonne %2$lld = %3$lld
zh_hans: 第%1$lld行第%2$lld列 = %3$lld

source: Row %lld: already contains %@
fr: Ligne %1$lld : contient déjà %2$@
zh_hans: 第%1$lld行：已包含%2$@

source: Show Candidates
fr: Afficher les candidats
zh_hans: 显示候选数

source: Show Hint
fr: Afficher l'indice
zh_hans: 显示提示

source: Shows how long the current puzzle has been running.
fr: Affiche depuis combien de temps la grille en cours est lancée.
zh_hans: 显示当前谜题已经进行了多久。

source: Shows or hides candidate digits across the board to help you inspect possibilities.
fr: Affiche ou masque les candidats sur toute la grille pour vous aider à explorer les possibilités.
zh_hans: 显示或隐藏整张棋盘上的候选数，帮助你检查各种可能性。

source: Simple Coloring
fr: Coloriage simple
zh_hans: 简单着色法

# Simple Coloring on %lld: any cell that sees both colors cannot contain %lld.
source: Simple Coloring on %1$lld: any cell that sees both colors cannot contain %2$lld.
fr: Coloration simple sur %1$lld : toute cellule qui voit les deux couleurs ne peut pas contenir %2$lld.
zh_hans: 数字%1$lld的简单着色：任何同时看到两种颜色的单元格都不能包含%2$lld。

source: Simple Coloring on %lld: one color contradicts itself, so every candidate of that color can be removed.
fr: Coloration simple sur %1$lld : une couleur se contredit elle-même, donc chaque candidat de cette couleur peut être supprimé.
zh_hans: 数字%1$lld的简单着色：一种颜色自相矛盾，因此该颜色的所有候选数都可以删除。

source: Simple Coloring on %lld: the light cells see both colors and can be eliminated.
fr: Coloriage simple sur %lld : les cellules en clair voient les deux couleurs et peuvent être éliminées.
zh_hans: 简单着色法（%lld）：浅色单元格可以看到两种颜色，可以被排除。
